#Область ПрограммныйИнтерфейс

// Обработчик события
Процедура ПриИзмененииСтрокиТабличнойЧасти(Форма) Экспорт
	
	ТекущиеДанные = Форма.Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПересчитатьСуммуВСтрокеТабличнойЧасти(ТекущиеДанные);
	Форма.Объект.СуммаДокумента = Форма.Объект.Товары.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

// Пересчитывает суммы в строке
// 
// СтрокаТабличнойЧасти - СтрокаТабличнойЧасти
//
//
Процедура ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти)
	
	СуммаПоСтроке = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	СтрокаТабличнойЧасти.Сумма = СуммаПоСтроке;
	
КонецПроцедуры

#КонецОбласти
